getting-started-with-lists/slides.tex
% Created 2010-11-10 Wed 12:22
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Getting started with Lists}
\author{FOSSEE}
\date{2010-09-14 Tue}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle










\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item How to create lists
\item Structure of lists
\item Access list elements
\item Append elements to lists
\item Deleting elements from lists
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-2}

\begin{itemize}
\item What happens when you do nonempty[-1].
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Solution 1}
\label{sec-3}

\begin{itemize}
\item It gives the last element , 1.234
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Questions}
\label{sec-4}

\begin{itemize}
\item What is the syntax to get the element `and'
\end{itemize}

in the list,listinlist ?


\begin{itemize}
\item How would you get `and' using negative indices?
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Solutions}
\label{sec-5}

\begin{verbatim}

listinlist[1]
listinlist[-5]
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Questions}
\label{sec-6}


\begin{itemize}
\item Remove the third element from the list, listinlist.
\item Remove `and' from the list, listinlist.
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Solutions}
\label{sec-7}

\begin{verbatim}

del(listinlist[2])
listinlist.remove('and')
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Summary}
\label{sec-8}

\begin{verbatim}

l=[1,2,3,4]
l[-1]
l.append(5)
del(l[2])
l.remove(2)
len(l)
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-9}

  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
\end{frame}

\end{document}
